Revit 2027 API
ExportLinetypeKey(String) Constructor
 Constructs a new default ExportLinetypeKey using the original line type name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeKey(
	string originalLinetypeName
)
Public Sub New (
	originalLinetypeName As String
)
public:
ExportLinetypeKey(
	String^ originalLinetypeName
)
new :
        originalLinetypeName : string -> ExportLinetypeKey
Parameters
originalLinetypeName String
 The original line type name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace